namespace gh_Day15
{
    internal class gh02
    {
        /********************************************************************************************************************************
         
          *  과제  2. 빌더패턴 활용하기

             이번 강의에선 빌더패턴의 예시로, 게임에 필요한 오브젝트를 생성하는 코드를 다루었었습니다.
             해당 개념을 참고하여, 원하는 Builder클래스를 만들고, 빌더를 통해서 다양한 객체를 생성해보세요.


             아래는 예시입니다. 예시를 참고하여 원하는 Builder를 만들어 보세요.

          1. MonsterBuilder 클래스를 만들어 몬스터의 이름, 외형, 전리품, 경험치, 공격범위, 전투스타일 등을 조합하여
             여러 유형의 Monster들을 만들 수 있습니다.

          2. AnimalBuilder 클래스를 만들어 동물의 이름, 외형, 생산품, 울음소리, 사료종류, 등을 조합하여
             여러 유형의 Animal들을 만들 수 있습니다.

          3. UnitBuilder 클래스를 만들어 유닛의 이름, 이동방법, 공격타입, 방어타입, 생산가격 등을 조합하여
             여러 유형의 Unit들을 만들 수 있습니다.

          4. UnitBuilder 클래스를 만들어 유닛의 이름, 이동방법, 공격타입, 방어타입, 생산가격 등을 조합하여
             여러 유형의 Unit들을 만들 수 있습니다.
          
         
         ********************************************************************************************************************************/





        static void Main123(string[] args)
        {
        }
    }
}
